int main()
{
    int number = 4999;
    char result[4][15];
    for (int i = 0; i < 4; i++) {
        for (int j = 0; j < 15; j++) {
        result[i][j] = ' ';
	}
}
    char thousands[9][15] = {" тыс€ча ", " две тыс€чи ", " три тыс€чи ", " четыре тыс€чи ", " п€ть тыс€ч", " шесть тыс€ч ", " семь тыс€ч ", " восемь тыс€ч ", " дев€ть тыс€ч "};
    char hundreds[9][15] = {" сто ", " двести ", " триста ", " четыреста ", " п€тсот ", " шестсот ", " семсот ", " восемсот ", " дев€тсот "};
    char teens[9][15] = {" дес€ть ", " одинадцать ", " двенадцать ", " тринадцать ", " четырнадцать ", " п€тнадцать ", " шестнадцать ", " семнадцать ", " восемнадцать ", " дев€тнадцать "};
    char dozens[9][15] = {" двадцать ", " тридцать ", " сорок ", " п€тдес€т ", " шестдес€т ", " семдес€т ", " восемдес€т ", " дев€носто "};
    char units[9][15] = {" один ", " два ", " три ", " четыре ", " п€ть ", " шесть ", " семь ", " восемь ", " дев€ть "};
    int i = 0;
    while (i < 15) {
        i++;
        result[0][i] = thousands[number / 1000 - 1][i];
        result[1][i] = hundreds[number % 1000 / 100 - 1][i];
        if (number % 100 >= 10 && number % 100 < 20) {
            result[2][i] = teens[number % 100 - 10][i];
        }
        else {
            result[2][i] = dozens[number % 100 / 10 - 2 ][i];
            result[3][i] = units[number % 10 - 1][i];
        }
    }
    return 0;
}
