/**
 * @mainpage
 * # Загальне завдання
 * При  виконанні  завдання  з  розробки  інформаційно-довідкової  системи
необхідно виконати наступне:
1.  З розділу “Розрахункове завдання / Індивідуальні завдання”, відповідно
до варіанта завдання, обрати прикладну галузь;
2.  Для прикладної галузі розробити розгалужену ієрархію класів, що описана
у завданні та складається  з одного базового класу та двох спадкоємців.
Класи повинні мати перевантажені оператори введення-виведення даних
та порівняння;
3.  Розробити  клас-список  CList.[h/cpp],  що  буде  включати  до  себе  массив
(STL-коллекцію) вказівників до базового класу.  А також базові  методи
роботи  з  списком:  а)  очистка  списку  б)  відображення  списку  в)
додання/видалення/отримання/оновлення елементу
4.  Розробити  клас-контролер  Controller.[h/cpp],  що буде включати колекцію
розроблених  класів,  та  наступні  методи  роботи  з  цією  колекцією:  а)
читання  даних  з  файлу  та  їх  запис  у  контейнер  (STL-контейнер);  б)
запис даних з контейнера у файл; в) сортування елементів у контейнері
за  вказаними  критеріями:  поле  та  напрям  сортування,  які  задаються
користувачем з клавіатури; г) пошук елементів за вказаними критеріями
(три критерія, що присутні у кожному варіанті);
5.  Розробити  клас  Menu.[h/cpp],  який   має  відображати  діалогове  меню  для
демонстрації реалізованих функцій класу контролера;
 *
 * @author Starovoytov N.
 * @date 14-june-2021
 * @version 1.0
 */

/**
 * @file main.cpp
 * @brief Основний файл з демонстрацією роботи програми
 *
 * @author Starovoytov N.
 * @date 14-june-2021
 * @version 1.0
 */

#include "menu.h"

/**
 * **Головна функція.**
 *
 * Послідовність дій:
 * - Створення об'єкту Dialog_menu класа {@link Menu}
 * - Виклик методу {@link Call_Dialog_Menu}
 * @return 0 - успішний код повернення з програми
 */
int main(){

    Menu Dialog_menu;
    Dialog_menu.Call_Dialog_Menu();

    return 0;
}